BojanJurca/Esp32_oscilloscope/servers/telnetServer.hpp
    #ifndef __USER_MANAGEMENT__
        #ifdef SHOW_COMPILE_TIME_INFORMATION
            #pragma message "Implicitly including userManagement.hpp (needed for login on to Telnet server)"
        #endif
      #include "userManagement.hpp"      // for logging in
    #endif


    // define some IAC telnet commands
    #define __IAC__               0Xff   // 255 as number
    #define IAC                   "\xff" // 255 as string
    #define __DONT__              0xfe   // 254 as number
    #define DONT                  "\xfe" // 254 as string
    #define __DO__                0xfd   // 253 as number
    #define DO                    "\xfd" // 253 as string
    #define __WONT__              0xfc   // 252 as number
    #define WONT                  "\xfc" // 252 as string
    #define __WILL__              0xfb   // 251 as number
    #define WILL                  "\xfb" // 251 as string
    #define __SB__                0xfa   // 250 as number
    #define SB                    "\xfa" // 250 as string
    #define __SE__                0xf0   // 240 as number
    #define SE                    "\xf0" // 240 as string
    #define __LINEMODE__          0x22   //  34 as number
    #define LINEMODE              "\x22" //  34 as string
    #define __NAWS__              0x1f   //  31 as number
    #define NAWS                  "\x1f" //  31 as string
    #define __SUPPRESS_GO_AHEAD__ 0x03   //   3 as number
    #define SUPPRESS_GO_AHEAD     "\x03" //   3 as string
    #define __ECHO__              0x01   //   1 as number
    #define ECHO                  "\x01" //   1 as string 

    // control telnetServer critical sections
    static SemaphoreHandle_t __telnetServerSemaphore__ = xSemaphoreCreateMutex (); 

    // log what is going on within telnetServer
    byte telnetServerConcurentTasks = 0;
    byte telnetServerConcurentTasksHighWatermark = 0;


    // ----- telnetConnection class -----

    class telnetConnection {

      public:

        // telnetConnection state
        enum STATE_TYPE {
          NOT_RUNNING = 0,
          RUNNING = 2
        };
        STATE_TYPE state () { return __state__; }


        telnetConnection ( // the following parameters will be handeled by telnetConnection instance
                         int connectionSocket,
                         String (* telnetCommandHandlerCallback) (int argc, char *argv [], telnetConnection *tcn), // telnetCommandHandler callback function provided by calling program
                         char *clientIP, char *serverIP
                       )  {
                            // create a local copy of parameters for later use
                            __connectionSocket__ = connectionSocket;
                            __telnetCommandHandlerCallback__ = telnetCommandHandlerCallback;
                            strncpy (__clientIP__, clientIP, sizeof (__clientIP__)); __clientIP__ [sizeof (__clientIP__) - 1] = 0; // copy client's IP since connection may live longer than the server that created it
                            strncpy (__serverIP__, serverIP, sizeof (__serverIP__)); __serverIP__ [sizeof (__serverIP__) - 1] = 0; // copy server's IP since connection may live longer than the server that created it
                            // handle connection in its own thread (task)       
                            #define tskNORMAL_PRIORITY 1
                            #ifdef TELNET_SERVER_CORE
                                BaseType_t taskCreated = xTaskCreatePinnedToCore (__connectionTask__, "telnetConnection", TELNET_CONNECTION_STACK_SIZE, this, tskNORMAL_PRIORITY, NULL, TELNET_SERVER_CORE);
                            #else
                                BaseType_t taskCreated = xTaskCreate (__connectionTask__, "telnetConnection", TELNET_CONNECTION_STACK_SIZE, this, tskNORMAL_PRIORITY, NULL);
                            #endif
                            if (pdPASS != taskCreated) {
                                #ifdef __DMESG__
                                    dmesgQueue << "[telnetConnection] xTaskCreate error";
                                #endif
                            } else {
                                __state__ = RUNNING;

                                xSemaphoreTake (__telnetServerSemaphore__, portMAX_DELAY);
                                    telnetServerConcurentTasks++;
                                    if (telnetServerConcurentTasks > telnetServerConcurentTasksHighWatermark)
                                        telnetServerConcurentTasksHighWatermark = telnetServerConcurentTasks;
                                xSemaphoreGive (__telnetServerSemaphore__);

                                return; // success

                            }
                            #ifdef __DMESG__
                                dmesgQueue << "[telnetConnection] xTaskCreate error";
                            #endif
                          }

        ~telnetConnection ()  {
                                  xSemaphoreTake (__telnetServerSemaphore__, portMAX_DELAY);
                                      telnetServerConcurentTasks--;
                                  xSemaphoreGive (__telnetServerSemaphore__);
                                  closeConnection ();
                              }

        int getSocket () { return __connectionSocket__; }

        char *getClientIP () { return __clientIP__; }

        char *getServerIP () { return __serverIP__; }

        bool connectionTimeOut () { return __telnet_connection_time_out__ && millis () - __lastActive__ >= __telnet_connection_time_out__; }
        
        void closeConnection () {
                                  int connectionSocket;
                                  xSemaphoreTake (__telnetServerSemaphore__, portMAX_DELAY);
                                    connectionSocket = __connectionSocket__;
                                    __connectionSocket__ = -1;
                                  xSemaphoreGive (__telnetServerSemaphore__);
                                  if (connectionSocket > -1) close (connectionSocket);
                                }

        // telnet session related variables
        char *getUserName () { return __userName__; }
        #ifdef __FILE_SYSTEM__
          char *getHomeDir () { return __homeDir__; }
          char *getWorkingDir () { return __workingDir__; }
        #endif
        uint16_t getClientWindowWidth () { return __clientWindowWidth__; }
        uint16_t getClientWindowHeight () { return __clientWindowHeight__; }

        // writing output to telnet with error logging (dmesg)
        int sendTelnet (const char *buf, size_t len) { 
            int i = sendAll (__connectionSocket__, buf, len, __telnet_connection_time_out__);
            if (i <= 0) {
                #ifdef __DMESG__
                    dmesgQueue << "[telnetConnection] send error: " << errno << " " << strerror (errno);
                #endif
            }
            return i;
        }

        int sendTelnet (const char *buf) { return sendTelnet (buf, strlen (buf)); }

        // reading input from Telnet client with extraction of IAC commands
        char recvTelnetChar (bool onlyPeek = false) { // returns valid character or 0 in case of error, extracts IAC commands from stream
          // if there is a character that has been just peeked previously return it now
          if (__peekedOnlyChar__) { char c = __peekedOnlyChar__; __peekedOnlyChar__ = 0; return c; }
          // if we are just peeking check the socket
          if (onlyPeek) {
            char c; if (recv (__connectionSocket__, &c, sizeof (c), MSG_PEEK) == -1) return 0; // meaning that no character is pending to be read
          }
          // read the next character from the socket
        tryReadingCharAgain:
          // if time-out occured return 0 
          if (__telnet_connection_time_out__ && millis () - __lastActive__ >= __telnet_connection_time_out__) return 0; // time-out

          char charRead = 0;
          char c [2];
          if (recvAll (__connectionSocket__, c, sizeof (c), NULL, __telnet_connection_time_out__) <= 0) return 0;
          
          switch (c [0]) {
              case 3:       charRead = 3; break;    // Ctrl-C
              case 4:                               // Ctrl-D
              case 26:      charRead = 4; break;    // Ctrl-Z
              case 8:       charRead = 8; break;    // BkSpace
              case 127:     charRead = 127; break;  // Del
              case 9:       charRead = 9; break;    // Tab
              case 10:      charRead = 10; break;   // Enter
              case __IAC__: 
                              // read the next character
                              if (recvAll (__connectionSocket__, c, sizeof (c), NULL, __telnet_connection_time_out__) <= 0) return 0;
                              switch (c [0]) {
                                case __SB__: 
                                              // read the next character
                                              if (recvAll (__connectionSocket__, c, sizeof (c), NULL, __telnet_connection_time_out__) <= 0) return 0;
                                              if (c [0] == __NAWS__) { 
                                                // read the next 4 bytes indication client window size
                                                char c [5];
                                                if (recvAll (__connectionSocket__, c, sizeof (c), NULL, __telnet_connection_time_out__) < 4) return 0;
                                                __clientWindowWidth__ = (uint16_t) c [0] << 8 | (uint8_t) c [1]; 
                                                __clientWindowHeight__ = (uint16_t) c [2] << 8 | (uint8_t) c [3];
                                              }
                                              break;
                                // in the following cases the 3rd character is following, ignore this one too
                                case __WILL__:
                                case __WONT__:
                                case __DO__:
                                case __DONT__:
                                                if (recvAll (__connectionSocket__, c, sizeof (c), NULL, __telnet_connection_time_out__) <= 0) return 0;
                                default:        // ignore
                                                break;
                              } // switch level 2, after IAC
                              break;              
              default:      
                            __lastActive__ = millis (); // reset connection level countdown after sucessful read
                            if ((c [0] >= 19) && (c [0] < 240)) charRead = c [0]; // Ctrl-S <= c < SE, try to ignore control characters
                            break; // ignore other characters
          } // switch level 1

          if (onlyPeek) {
            if (charRead) { // if there is a regular character that we have just read
              __peekedOnlyChar__ = charRead;
            } else { // no regular characer read (jet), check if there is something more waiting
              if (recv (__connectionSocket__, &charRead, sizeof (charRead), MSG_PEEK) == -1) return 0; // meaning that no character is pending to be read
              else goto tryReadingCharAgain;
            }
          } else {
            if (!charRead) goto tryReadingCharAgain;
          }
          
          return charRead;
        }

        // reads incoming stream, returns last character read or 0-error, 3-Ctrl-C, 4-EOF, 10-Enter, ...
        char recvTelnetLine (char *buf, size_t len, bool trim = true) {
          if (!len) return 0;
          int characters = 0;
          buf [0] = 0;

