BojanJurca/Esp32_oscilloscope/servers/telnetServer.hpp
          else if (argv0Is ("free"))      { 
                                              if (argc == 1)                                        return __free__ (0, tcn);
                                              if (argc == 2) {
                                                  int n = atoi (argv [1]); if (n > 0 && n <= 3600)  return __free__ (n, tcn);
                                              }
                                              return "Wrong syntax, use free [<n>]   (where 0 < n <= 3600)";
                                          } 

          else if (argv0Is ("netstat"))   {
                                              if (argc == 1)                                        return __netstat__ (0, tcn);
                                              if (argc == 2) {
                                                  int n = atoi (argv [1]); if (n > 0 && n < 3600)   return __netstat__ (n, tcn);
                                              }
                                              return "Wrong syntax, use netstat [<n>]   (where 0 < n <= 3600)";
                                          }

          else if (argv0Is ("kill"))      { 
                                              if (!strcmp (__userName__, "root")) {
                                                if (argc == 2) {
                                                    int n = atoi (argv [1]); if (n >= LWIP_SOCKET_OFFSET && n < LWIP_SOCKET_OFFSET + MEMP_NUM_NETCONN) return __kill__ (n);
                                                }
                                                return cstring ("Wrong syntax, use kill <socket>   (where ") + cstring (LWIP_SOCKET_OFFSET) + " <= socket <= " + cstring (LWIP_SOCKET_OFFSET + MEMP_NUM_NETCONN - 1) + ")";
                                              }
                                              else return "Only root may close sockets.";
                                          }

          else if (argv0Is ("nohup"))     {
                                              if (argc == 1)                                    return __nohup__ (0);
                                              if (argc == 2) {
                                                int n = atoi (argv [1]); if (n > 0 && n < 3600) return __nohup__ (n);
                                              }
                                              return "Wrong syntax, use nohup [<n>]   (where 0 < n <= 3600)";
                                          }
                                        
          else if (argv0Is ("reboot"))    {
                                              if (argc == 1)                            return __reboot__ (true);
                                              if (argv1Is ("-h") || argv1Is ("-hard"))  return __reboot__ (false);
                                              return "Wrong syntax, use reboot [-hard]"; 
                                          }
                                      
          else if (argv0Is ("quit"))      { return argc == 1 ? __quit__ () : "Wrong syntax, use quit"; }

          else if (argv0Is ("date"))      {
                                              if (argc == 1)                                              return __getDateTime__ ();
                                                  if (argc == 4 && (argv1Is ("-s") || argv1Is ("-set")))  return __setDateTime__ (argv [2], argv [3]);
                                              return "Wrong syntax, use date [-set YYYY/MM/DD hh:mm:ss] (use hh in 24 hours time format)";
                                          }

        #ifdef __TIME_FUNCTIONS__

            else if (argv0Is ("uptime"))    { return argc == 1 ? __uptime__ () : "Wrong syntax, use uptime"; }

            else if (argv0Is ("ntpdate"))   {
                                                if (argc == 1) return __ntpdate__ ();
                                                if (argc == 2) return __ntpdate__ (argv [1]);
                                                return "Wrong syntax, use ntpdate [ntpServer]";
                                            }

            else if (argv0Is ("crontab"))   { return argc == 1 ? __cronTab__ (tcn) : "Wrong syntax, use crontab"; }

        #endif

        else if (argv0Is ("ping"))      { 
                                            if (argc == 2) return __ping__ (tcn, argv [1]);
                                            return "Wrong syntax, use ping <target computer>"; 
                                        }

        #ifdef __NETWK__

            else if (argv0Is ("ifconfig"))  {
                                                  if (argc == 1) return ifconfig (__connectionSocket__);
                                                  return "Wrong syntax, use arp";              
                                            }

            else if (argv0Is ("arp"))       { return argc == 1 ? arp (__connectionSocket__) : "Wrong syntax, use arp"; }

            else if (argv0Is ("iw"))        { return argc == 1 ? iw (__connectionSocket__) : "Wrong syntax, use iw"; }

        #endif

        #ifdef __DMESG__

          else if (argv0Is ("dmesg"))     { 
                                              bool f = false;
                                              bool t = false;
                                              for (int i = 1; i < argc; i++) {
                                                      if (!strcmp (argv [i], "-f") || !strcmp (argv [i], "-follow")) f = true;
                                                  else if (!strcmp (argv [i], "-t") || !strcmp (argv [i], "-time")) t = true;
                                                  else return "Wrong syntax, use dmesg [-follow] [-time]";
                                              }
                                              return __dmesg__ (f, t, tcn);
                                          }
                                      
        #endif

          else if (argv0Is ("telnet"))    { 
                                              if (argc == 2)                                return __telnet__ (argv [1], 23, tcn);
                                              if (argc == 3) {
                                                  int port = atoi (argv [2]); if (port > 0) return __telnet__ (argv [1], port, tcn);
                                              }
                                              return "Wrong syntax, use telnet <server> [port]";
                                          } 

        #ifdef __HTTP_CLIENT__

          else if (argv0Is ("curl"))      { 
                                              if (argc == 2) return __curl__ ("GET", argv [1], tcn);
                                              if (argc == 3) return __curl__ (argv [1], argv [2], tcn);
                                              return "Wrong syntax, use curl [method] http://url";
                                          } 
                                      
        #endif

        #ifdef __SMTP_CLIENT__

          else if (argv0Is ("sendmail"))  { 
                                              char *smtpServer = (char *) "";
                                              char *smtpPort = (char *) "";
                                              char *userName = (char *) "";
                                              char *password = (char *) "";
                                              char *from = (char *) "";
                                              char *to = (char *) ""; 
                                              char *subject = (char *) ""; 
                                              char *message = (char *) "";
                                            
                                              for (int i = 1; i < argc - 1; i += 2) {
                                                      if (!strcmp (argv [i], "-S")) smtpServer = argv [i + 1];
                                                  else if (!strcmp (argv [i], "-P")) smtpPort = argv [i + 1];
                                                  else if (!strcmp (argv [i], "-u")) userName = argv [i + 1];
                                                  else if (!strcmp (argv [i], "-p")) password = argv [i + 1];
                                                  else if (!strcmp (argv [i], "-f")) from = argv [i + 1];
                                                  else if (!strcmp (argv [i], "-t")) to = argv [i + 1];
                                                  else if (!strcmp (argv [i], "-s")) subject = argv [i + 1];
                                                  else if (!strcmp (argv [i], "-m")) message = argv [i + 1];
                                                  else return "Wrong syntax, use sendmail [-S smtpServer] [-P smtpPort] [-u userName] [-p password] [-f from address] [t to address list] [-s subject] [-m messsage]";
                                              }

