BojanJurca/Esp32_oscilloscope/servers/telnetServer.hpp
        #if USER_MANAGEMENT == UNIX_LIKE_USER_MANAGEMENT
  
            else if (argv0Is ("useradd")) { 
                                              if (strcmp (__userName__, "root"))                                      return "Only root may add users.";
                                              if (argc == 6 && !strcmp (argv [1], "-u") && !strcmp (argv [3], "-d"))  return userManagement.userAdd (argv [5], argv [2], argv [4]);
                                                                                                                      return "Wrong syntax, use useradd -u userId -d userHomeDirectory userName (where userId > 1000)";
                                          }
                                          
            else if (argv0Is ("userdel")) { 
                                              if (strcmp (__userName__, "root"))  return "Only root may delete users.";
                                              if (argc != 2)                      return "Wrong syntax. Use userdel userName";
                                              if (!strcmp (argv [1], "root"))     return "You don't really want to to this.";
                                                                                  return userManagement.userDel (argv [1]);
                                          }
  
          else if (argv0Is ("passwd"))    { 
                                              if (argc == 1)                                                             return __passwd__ (__userName__);
                                              if (argc == 2) {
                                                if (!strcmp (__userName__, "root") || !strcmp (argv [1], __userName__))  return __passwd__ (argv [1]); 
                                                else                                                                     return "You may change only your own password.";
                                              }
                                              return "";
                                          }
                                                      
        #endif
                                      
            else return "Invalid command, use \"help\" to display available commands.";
        }

        const char *__help__ (telnetConnection *tcn) {
          char *h = (char *)  "Suported commands:"
                              "\r\n      help"
                              "\r\n      clear"
                              "\r\n      uname"
                              "\r\n      free [<n>]    (where 0 < n <= 3600)"
                              "\r\n      nohup [<n>]   (where 0 < n <= 3600)"
                              "\r\n      reboot [-h]   (-h for hard reset)"
                              "\r\n      quit"
                              #ifdef __DMESG__
                                "\r\n  dmesg circular queue:"
                                "\r\n      dmesg [-follow] [-time]"
                              #endif
                              "\r\n  time commands:"
                              #ifdef __TIME_FUNCTIONS__                                
                                "\r\n      uptime"
                              #endif
                              "\r\n      date [-set <YYYY/MM/DD hh:mm:ss>]"
                              #ifdef __TIME_FUNCTIONS__                                
                                "\r\n      ntpdate [<ntpServer>]"
                                "\r\n      crontab"
                              #endif
                                "\r\n  network commands:"
                                "\r\n      ping <terget computer>"
                              #ifdef __NETWK__
                                "\r\n      ifconfig"
                                "\r\n      arp"
                                "\r\n      iw"
                                "\r\n      netstat [<n>]   (where 0 < n <= 3600)"
                                "\r\n      kill <socket>   (where socket is a valid socket)"
                              #endif
                                "\r\n      telnet <server> [port]"
                              #ifdef __HTTP_CLIENT__
                                "\r\n      curl [method] http://url"
                              #endif
                              #ifdef __FTP_CLIENT__ 
                                "\r\n      ftpput [-S ftpServer] [-P ftpPort] [-u userName] [-p password] <localFileName> <remoteFileName>"
                                "\r\n      ftpget [-S ftpServer] [-P ftpPort] [-u userName] [-p password] <localFileName> <remoteFileName>"
                              #endif
                              #ifdef __SMTP_CLIENT__
                                "\r\n      sendmail [-S smtpServer] [-P smtpPort] [-u userName] [-p password] [-f from address] [t to address list] [-s subject] [-m messsage]"
                              #endif
                              #ifdef __FILE_SYSTEM__
                                "\r\n  file commands:"
                                #if FILE_SYSTEM == FILE_SYSTEM_FAT
                                "\r\n      mkfs.fat"
                                #endif
                                #if FILE_SYSTEM == FILE_SYSTEM_LITTLEFS
                                "\r\n      mkfs.littlefs"
                                #endif
                                "\r\n      fs_info"
                                "\r\n      ls [<directoryName>]"
                                "\r\n      tree [<directoryName>]"
                                "\r\n      mkdir <directoryName>"
                                "\r\n      rmdir <directoryName>"
                                "\r\n      cd <directoryName or ..>"
                                "\r\n      pwd"
                                "\r\n      cat [>] <fileName>"
                                "\r\n      vi <fileName>"
                                "\r\n      cp <existing fileName> <new fileName>"
                                "\r\n      mv <existing fileName or directoryName> <new fileName or directoryName>"
                                "\r\n      rm <fileName>"
                                "\r\n      diskstat [<n>]   (where 0 < n <= 3600)"
                              #endif
                              #if USER_MANAGEMENT == UNIX_LIKE_USER_MANAGEMENT
                                "\r\n  user management:"                                        
                                "\r\n       useradd -u <userId> -d <userHomeDirectory> <userName>"
                                "\r\n       userdel <userName>"
                                "\r\n       passwd [<userName>]"
                              #endif
                              #ifdef __FILE_SYSTEM__
                                "\r\n  configuration files used by system:"
                                #ifdef __TIME_FUNCTIONS__
                                  "\r\n      /usr/share/zoneinfo                       (contains (POSIX) timezone information)"
                                  "\r\n      /etc/ntp.conf                             (contains NTP time servers names)"
                                  "\r\n      /etc/crontab                              (contains scheduled tasks)"
                                #endif
                                #ifdef __NETWK__
                                  "\r\n      /network/interfaces                       (contains STA(tion) configuration)"
                                  "\r\n      /etc/wpa_supplicant/wpa_supplicant.conf   (contains STA(tion) credentials)"
                                  "\r\n      /etc/dhcpcd.conf                          (contains A(ccess) P(oint) configuration)"
                                  "\r\n      /etc/hostapd/hostapd.conf                 (contains A(ccess) P(oint) credentials)"
                                #endif
                                #ifdef __FTP_CLIENT__
                                  "\r\n      /etc/ftp/ftpclient.cf                     (contains ftpput and ftpget default settings)"
                                #endif
                                #ifdef __SMTP_CLIENT__
                                  "\r\n      /etc/mail/sendmail.cf                     (contains sendMail default settings)"
                                #endif
                                #if USER_MANAGEMENT == UNIX_LIKE_USER_MANAGEMENT
                                  "\r\n      /etc/passwd                               (contains users' accounts information)"
                                  "\r\n      /etc/shadow                               (contains users' passwords)"
                                #endif
                              #endif
                              ;
            sendTelnet (h);
            return "";                                            
        }

        const char *__clear__ () { return "\x1b[2J"; } // ESC[2J = clear screen

