BojanJurca/Esp32_oscilloscope/servers/telnetServer.hpp
        cstring __uname__ () { return UNAME; }

        const char *__free__ (unsigned long delaySeconds, telnetConnection *tcn) {
            bool firstTime = true;
            int currentLine = 0;
            char s [128];
            do { // follow         
                if (firstTime || (tcn->getClientWindowHeight ()  && currentLine >= tcn->getClientWindowHeight ())) {
                    sprintf (s, "%sFree heap       Max block Free PSRAM\r\n-------------------------------------------", firstTime ? "" : "\r\n");
                    if (sendTelnet (s) <= 0) return "";
                    currentLine = 2; // we have just displayed 2 lines (header)
                }
                if (!firstTime && delaySeconds) { // wait and check if user pressed a key
                    unsigned long startMillis = millis ();
                    while (millis () - startMillis < (delaySeconds * 1000)) {
                        delay (100);
                        if (tcn->recvTelnetChar (true)) {
                            tcn->recvTelnetChar (false); // read pending character
                            return ""; // return if user pressed Ctrl-C or any key
                        } 
                        if (tcn->connectionTimeOut ()) { sendTelnet ("\r\nTime-out"); tcn->closeConnection (); return ""; }
                    }
                }
                sprintf (s, "\r\n%10lu   %10lu   %10lu  bytes", (unsigned long) ESP.getFreeHeap (), (unsigned long) heap_caps_get_largest_free_block (MALLOC_CAP_DEFAULT), (unsigned long) ESP.getFreePsram ());
                if (sendTelnet (s) <= 0) return "";
                firstTime = false;
                currentLine ++; // we have just displayed the next line (data)
            } while (delaySeconds);
            return "";
        }

        const char *__netstat__ (unsigned long delaySeconds, telnetConnection *tcn) {
            // variables for delta calculation
            additionalNetworkInformation_t lastAdditionalNetworkInformationn = {}; 
            additionalNetworkInformation_t lastAdditionalSocketInformation [MEMP_NUM_NETCONN] = {}; 

            char s [256];

            do {

                // clear screen
                if (delaySeconds) if (sendTelnet ("\x1b[2J") <= 0) return "";

                // display totals
                sprintf (s, "total bytes received and sent:                       %10lu      %10lu\r\n", additionalNetworkInformation.bytesReceived - lastAdditionalNetworkInformationn.bytesReceived, additionalNetworkInformation.bytesSent - lastAdditionalNetworkInformationn.bytesSent);

                // update variables for delta calculation
                lastAdditionalNetworkInformationn = additionalNetworkInformation;

                if (sendTelnet (s) <= 0) return "";

                // display header
                sprintf (s, "\r\n"
                            "socket  local address        remote address      bytes received      bytes sent      inactive\r\n"
                            "------------------------------------------------------------------------------------------------------------------------");
                if (sendTelnet (s) <= 0) return "";

                // scan through sockets
                for (int i = LWIP_SOCKET_OFFSET; i < LWIP_SOCKET_OFFSET + MEMP_NUM_NETCONN; i++) { // socket numbers are only within this range
                    char socketIP [46]; struct sockaddr_in socketAddress = {}; socklen_t len = sizeof (socketAddress);
                    // get server side address first
                    if (getsockname (i, (struct sockaddr *) &socketAddress, &len) != -1) {
                        inet_ntoa_r (socketAddress.sin_addr, socketIP, sizeof (socketIP));
                        sprintf (s, "\r\n  %2i    %s:%i                                                                       ", i, socketIP, ntohs (socketAddress.sin_port));
                        // get client side address next
                        if (getpeername (i, (struct sockaddr *) &socketAddress, &len) != -1) {
                            inet_ntoa_r (socketAddress.sin_addr, socketIP, sizeof (socketIP));
                            if (additionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesReceived < lastAdditionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesReceived || additionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesSent < lastAdditionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesSent) 
                                lastAdditionalSocketInformation [i - LWIP_SOCKET_OFFSET] = {0, 0};

                            sprintf (s + 31, "%s:%i               ", socketIP, ntohs (socketAddress.sin_port));
                            sprintf (s + 57, "%8lu      %10lu      %6lu s", additionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesReceived - lastAdditionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesReceived, additionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesSent - lastAdditionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesSent, (millis () - additionalSocketInformation [i - LWIP_SOCKET_OFFSET].lastActiveMillis) / 1000);

                            switch (additionalSocketInformation [i - LWIP_SOCKET_OFFSET].lastUsedAs) {
                                case __TELNET_SERVER_SOCKET__:  strcat (s, i == tcn->getSocket () ? " Telnet server (this conn.)" : " Telnet server");
                                                                break;
                                case __TELNET_CLIENT_SOCKET__:  strcat (s, " Telnet client");
                                                                break;
                                case __HTTP_SERVER_SOCKET__:    strcat (s, " HTTP server");
                                                                break;
                                case __HTTP_CLIENT_SOCKET__:    strcat (s, " HTTP client");
                                                                break;
                                case __FTP_SERVER_SOCKET__:     strcat (s, " FTP server ctrl. conn.");
                                                                break;
                                case __FTP_CLIENT_SOCKET__:     strcat (s, " FTP client ctrl. conn.");
                                                                break;
                                case __FTP_DATA_SOCKET__:       strcat (s, " FTP data conn.");
                                                                break;
                                case __SMTP_CLIENT_SOCKET__:    strcat (s, " SMTP client");
                                                                break;
                            }
                            
                        } else { // socket without a peer address - it must be a listening socket

