BojanJurca/Esp32_oscilloscope/servers/telnetServer.hpp
                            switch (additionalSocketInformation [i - LWIP_SOCKET_OFFSET].lastUsedAs) {
                                case __LISTENING_SOCKET__:      sprintf (s + 87, "%6lu s Listening socket", (millis () - additionalSocketInformation [i - LWIP_SOCKET_OFFSET].lastActiveMillis) / 1000);                                
                                                                break;
                                case __NTP_SOCKET__:            sprintf (s + 57, "%8lu      %10lu      %6lu s NTP client", additionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesReceived - lastAdditionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesReceived, additionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesSent - lastAdditionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesSent, (millis () - additionalSocketInformation [i - LWIP_SOCKET_OFFSET].lastActiveMillis) / 1000);
                                                                break;
                                case __PING_SOCKET__:           sprintf (s + 57, "%8lu      %10lu      %6lu s Ping client", additionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesReceived - lastAdditionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesReceived, additionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesSent - lastAdditionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesSent, (millis () - additionalSocketInformation [i - LWIP_SOCKET_OFFSET].lastActiveMillis) / 1000);
                                                                break;
                            }
                            
                        }

                        // update variables for delta calculation
                        lastAdditionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesReceived = additionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesReceived;
                        lastAdditionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesSent = additionalSocketInformation [i - LWIP_SOCKET_OFFSET].bytesSent;

                        if (sendTelnet (s) <= 0) return "";
                    }
                }

                // wait for a key press
                unsigned long startMillis = millis ();
                while (millis () - startMillis < (delaySeconds * 1000)) {
                    delay (100);
                    if (tcn->recvTelnetChar (true)) {
                        tcn->recvTelnetChar (false); // read pending character
                        return ""; // return if user pressed Ctrl-C or any key
                    } 
                    if (tcn->connectionTimeOut ()) { sendTelnet ("\r\nTime-out"); tcn->closeConnection (); return ""; }
                }

            } while (delaySeconds);
            return "";
        }

        cstring __kill__ (int i) { // i = socket number
          if (close (i) < 0) {
            #ifdef __DMESG__
                dmesgQueue << "[telnet] close() error: " << errno << " " << strerror (errno);
            #endif
            return cstring ("Error: ") + cstring (errno) + " " + strerror (errno);
          }
          return "socked closed.";
        }

        cstring __nohup__ (unsigned long timeOutSeconds) {
            __telnet_connection_time_out__ = timeOutSeconds * 1000;
            return timeOutSeconds ? cstring ("Time-out set to ") + cstring (timeOutSeconds) + " seconds." : "Time-out set to infinite.";
        }

        const char *__reboot__ (bool softReboot) {
            if (softReboot) {
                sendTelnet ("(Soft) rebooting ...");
                delay (250);
                ESP.restart ();
            } else {
                // cause WDT reset
                sendTelnet ("(Hard) rebooting ...");
                delay (250);
                esp_task_wdt_config_t wdtCfg = {0, 1 << 1, true};
                esp_task_wdt_init (&wdtCfg);
                esp_task_wdt_add (NULL);
                while (true);
            }
            return "";
        }
  
        const char *__quit__ () {
            closeConnection ();
            return "";  
        }
  
        cstring __getDateTime__ () {
            time_t t = time (NULL);
            if (t < 1687461154) return "The time has not been set yet."; // 2023/06/22 21:12:34 is the time when I'm writing this code, any valid time should be greater than this
            struct tm st;
            localtime_r (&t, &st);
            cstring s;
            sprintf (s.c_str (), "%04i/%02i/%02i %02i:%02i:%02i", 1900 + st.tm_year, 1 + st.tm_mon, st.tm_mday, st.tm_hour, st.tm_min, st.tm_sec);
            return s;
        }
    
        cstring __setDateTime__ (char *dt, char *tm) {
            int Y, M, D, h, m, s;
            if (sscanf (dt, "%i/%i/%i", &Y, &M, &D) == 3 && Y >= 1900 && M >= 1 && M <= 12 && D >= 1 && D <= 31 && sscanf (tm, "%i:%i:%i", &h, &m, &s) == 3 && h >= 0 && h <= 23 && m >= 0 && m <= 59 && s >= 0 && s <= 59) { // TO DO: we still do not catch all possible errors, for exmple 30.2.1966
                struct tm tm;
                tm.tm_year = Y - 1900; tm.tm_mon = M - 1; tm.tm_mday = D;
                tm.tm_hour = h; tm.tm_min = m; tm.tm_sec = s;
                time_t t = mktime (&tm); // time in local time
                if (t != -1) {
                    #ifdef __TIME_FUNCTIONS__
                        setTimeOfDay (t);
                    #else
                        // repeat most of the things what setTimeOfDay does (except setting __startupTime__) here
                        struct timeval newTime = {t, 0};
                        settimeofday (&newTime, NULL); 
                    #endif
                    return __getDateTime__ ();          
                }
            }
            return "Wrong format of date/time specified.";
        }         

      #ifdef __TIME_FUNCTIONS__

        cstring __uptime__ () {
            cstring s;
            char c [15];
            time_t t = time ();
            time_t uptime;
            if (t) { // if time is set
                struct tm strTime = localTime (t);
                sprintf (c, "%02i:%02i:%02i", strTime.tm_hour, strTime.tm_min, strTime.tm_sec);
                s = cstring (c) + " up ";     
            } else { // time is not set (yet), just read how far clock has come untill now
                s = "Up ";
            }
            uptime = getUptime ();
            int seconds = uptime % 60; uptime /= 60;
            int minutes = uptime % 60; uptime /= 60;
            int hours = uptime % 24;   uptime /= 24; // uptime now holds days
            if (uptime) s += cstring ((unsigned long) uptime) + " days, ";
            sprintf (c, "%02i:%02i:%02i", hours, minutes, seconds);
            s += c;
            return s;
        }

        cstring __ntpdate__ (char *ntpServer = NULL) {
            cstring r;
            if (ntpServer) {
                char *p = ntpDate (ntpServer);
                if (*p) return p; // ntpDate reported an error
            } else {
                char *p = ntpDate ();
                if (*p) return p; // ntpDate reported an error
            }
            ascTime (localTime (time (NULL)), r.c_str ());
            return cstring ("Time synchronized, currrent time is ") + r + ".";
        }

        const char *__cronTab__ (telnetConnection *tcn) {
            xSemaphoreTakeRecursive (__cronSemaphore__, portMAX_DELAY);
                if (!__cronTabEntries__) {
                    sendTelnet ("crontab is empty.");
                } else {
                    for (int i = 0; i < __cronTabEntries__; i ++) {
                        cstring s;
                        char c [30];
                        if (__cronEntry__ [i].second == ANY)      s += " * "; else { sprintf (c, "%2i ", __cronEntry__ [i].second);      s += c; }
                        if (__cronEntry__ [i].minute == ANY)      s += " * "; else { sprintf (c, "%2i ", __cronEntry__ [i].minute);      s += c; }
                        if (__cronEntry__ [i].hour == ANY)        s += " * "; else { sprintf (c, "%2i ", __cronEntry__ [i].hour);        s += c; }
                        if (__cronEntry__ [i].day == ANY)         s += " * "; else { sprintf (c, "%2i ", __cronEntry__ [i].day);         s += c; }
                        if (__cronEntry__ [i].month == ANY)       s += " * "; else { sprintf (c, "%2i ", __cronEntry__ [i].month);       s += c; }
                        if (__cronEntry__ [i].day_of_week == ANY) s += " * "; else { sprintf (c, "%2i ", __cronEntry__ [i].day_of_week); s += c; }
                        if (__cronEntry__ [i].lastExecuted) {
                                                                  ascTime (localTime (__cronEntry__ [i].lastExecuted), c);
                                                                  s += " "; s += c; s += " "; 
                                                            } else { 
                                                                  s += " (not executed yet)  "; 
                                                            }
                        if (__cronEntry__ [i].readFromFile)       s += " from /etc/crontab  "; else s += " entered from code  ";
                        s += __cronEntry__ [i].cronCommand;
                                                                  s += "\r\n";
                        if (sendTelnet (s.c_str ()) <= 0) break;
                    }
                }
            xSemaphoreGiveRecursive (__cronSemaphore__);
            return "";
        }

      #endif

          const char *__ping__ (telnetConnection *tcn, const char *pingTarget) {

              // overload onReceive member function to get notified about intermediate results
              class telnet_ping : public esp32_ping {
                  public:
                      telnetConnection *tcn;

                      void onStart () {
                          // remember some information that netstat telnet command would use
                          additionalSocketInformation [tcn->getSocket () - LWIP_SOCKET_OFFSET] = { __PING_SOCKET__, 0, 0, millis (), millis () };
                      }

                      void onSend (int bytes) {
                          // remember some information that netstat telnet command would use
                          additionalNetworkInformation.bytesSent += bytes;
                          additionalSocketInformation [tcn->getSocket () - LWIP_SOCKET_OFFSET].bytesSent += bytes;
                          additionalSocketInformation [tcn->getSocket () - LWIP_SOCKET_OFFSET].lastActiveMillis = millis ();
                      }

                      void onReceive (int bytes) {
                          // remember some information that netstat telnet command would use
                          additionalNetworkInformation.bytesReceived += bytes;
                          additionalSocketInformation [tcn->getSocket () - LWIP_SOCKET_OFFSET].bytesReceived += bytes;
                          additionalSocketInformation [tcn->getSocket () - LWIP_SOCKET_OFFSET].lastActiveMillis = millis ();

