BojanJurca/Esp32_oscilloscope/servers/telnetServer.hpp
                          // display intermediate results
                          char buf [100];
                          if (elapsed_time ())
                              sprintf (buf, "\r\nReply from %s: bytes = %i time = %.3f ms", target ().toString().c_str(), size (), elapsed_time ());
                          else
                              sprintf (buf, "\r\nReply from %s: time-out\n", target ().toString().c_str());
                          if (tcn->sendTelnet (buf) <= 0) stop ();
                          return;
                      }

                      void onWait () {
                          // stop waiting if a key is pressed
                          if (tcn->recvTelnetChar (true)) {
                              tcn->recvTelnetChar (false); // read pending character
                              stop ();
                          } 
                          return;
                      }
              };

              telnet_ping tping;
              tping.tcn = tcn;
              tping.ping (pingTarget, PING_DEFAULT_COUNT, PING_DEFAULT_INTERVAL, PING_DEFAULT_SIZE, PING_DEFAULT_TIMEOUT);
              char buf [200];
              if (tping.error () != ERR_OK) {
                  sprintf (buf, "%i\n", tping.error ());
              } else {
                  sprintf (buf, "Ping statistics for %s:\r\n"
                                    "    Packets: Sent = %i, Received = %i, Lost = %i", tping.target ().toString ().c_str (), tping.sent (), tping.received (), tping.lost ());
                  if (tping.sent ()) {
                      sprintf (buf, " (%.2f%% loss)\r\nRound trip:\r\n"
                                    "   Min = %.3f ms, Max = %.3f ms, Avg = %.3f ms, Stdev = %.3f ms", (float) tping.lost () / (float) tping.sent () * 100, tping.min_time (), tping.max_time (), tping.mean_time (), sqrt (tping.var_time () / tping.received ()));
                  }
              }
              tcn->sendTelnet (buf);
              return "\r\n";
          }

      #ifdef __DMESG__
  
          const char * __dmesg__ (bool follow, bool trueTime, telnetConnection *tcn) {
              #ifndef __TIME_FUNCTIONS__
                  if (trueTime) return "-time option is not supported (time_functions.h is not included)";
              #endif

              cstring s;
              bool firstRecord = true;
              dmesgQueueEntry_t *lastBack = NULL;
              for (auto e: dmesgQueue) { // scan dmesgQueue with iterator where the locking mechanism is already implemented

                  if (firstRecord) firstRecord = false; else s = "\r\n";
                  char c [25];
                  if (trueTime && e.time > 1687461154) { // 2023/06/22 21:12:34, any valid time should be greater than this
                      struct tm slt; 
                      localtime_r (&e.time, &slt); 
                      strftime (c, sizeof (c), "[%y/%m/%d %H:%M:%S] ", &slt);
                  } else {
                      sprintf (c, "[%10lu] ", e.milliseconds);
                  }
                  s += c;
                  s += e.message;
                  lastBack = dmesgQueue.back (); // remember the last change in case -f is specified
                  if (sendTelnet (s) <= 0) break;
              
              }

            // -follow?
            while (follow) {
                delay (100);

                // stop waiting if a key is pressed
                if (tcn->recvTelnetChar (true)) {
                    tcn->recvTelnetChar (false); // read pending character
                    return ""; // return if user pressed Ctrl-C or any key
                  } 
                if (tcn->connectionTimeOut ()) { sendTelnet ("\r\nTime-out"); tcn->closeConnection (); return ""; }

                // read the new dmsg entries if they appeared
                if (lastBack != dmesgQueue.back ()) { // changed
                    auto e = dmesgQueue.begin (lastBack);
                    ++ e; // skip one message - it has already been displayed
                    while (e != dmesgQueue.end ()) {
                      
                        s = "\r\n";
                        char c [25];

                        if (trueTime && (*e).time > 1687461154) { // 2023/06/22 21:12:34, any valid time should be greater than this
                            struct tm slt; 
                            localtime_r (&(*e).time, &slt); 
                            strftime (c, sizeof (c), "[%y/%m/%d %H:%M:%S] ", &slt);
                        } else {
                            sprintf (c, "[%10lu] ", (*e).milliseconds);
                        }
                        s += c;
                        s += (*e).message;
                        lastBack = dmesgQueue.back (); // remember the last change
                        if (sendTelnet (s) <= 0) break;

                        ++ e;
                    }
                }                  
            }

            return "";
        }      

    #endif

      struct __telnetSharedMemory__ {
          int socketTowardsServer;
          int socketTowardsClient;
          unsigned long time_out;
          bool threadTowardsServerFinished;
          bool threadTowardsClientFinished;
          bool clientError;
          bool clientTimeOut;
        };
        
        cstring __telnet__ (char *server, int port, telnetConnection *tcn) {
          // get server address
          struct hostent *he = gethostbyname (server);
          if (!he) return cstring ("gethostbyname() error: ") + cstring (h_errno) + " " + hstrerror (h_errno);
          // create socket
          int connectionSocket = socket (PF_INET, SOCK_STREAM, 0);
          if (connectionSocket == -1) return cstring ("socket() error: ") + cstring (errno) + " " + strerror (errno);

          // remember some information that netstat telnet command would use
          additionalSocketInformation [connectionSocket - LWIP_SOCKET_OFFSET] = { __TELNET_CLIENT_SOCKET__, 0, 0, millis (), millis () };
          
