BojanJurca/Esp32_oscilloscope/servers/telnetServer.hpp
          // make the socket not-blocking so that time-out can be detected
          if (fcntl (connectionSocket, F_SETFL, O_NONBLOCK) == -1) {
              close (connectionSocket);
              return cstring ("fcntl() error: ") + cstring (errno) + " "  + strerror (errno);
          }
          // connect to server
          struct sockaddr_in serverAddress;
          serverAddress.sin_family = AF_INET;
          serverAddress.sin_port = htons (port);
          serverAddress.sin_addr.s_addr = *(in_addr_t *) he->h_addr; 
          if (connect (connectionSocket, (struct sockaddr *) &serverAddress, sizeof (serverAddress)) == -1) {
              if (errno != EINPROGRESS) {
                  close (connectionSocket);
                  return cstring ("connect() error: ") + cstring (errno) + " "  + strerror (errno);
                }
            } // it is likely that socket is not connected yet at this point
          // send information about IP used to connect to server back to client
          {
              char serverIP [14 + 46 + 4] = "Connecting to ";
              inet_ntoa_r (serverAddress.sin_addr, serverIP + 14, 46);
              strcat (serverIP, " ...");
              if (sendTelnet (serverIP) <= 0) return "";
          }

          // we need 2 tasks, one for data transfer client -> ESP32 -> server and the other client <- ESP32 <- server
          // for client -> ESP32 -> server direction we are going to use current task  
          // for client <- ESP32 <- server direction we'll start a new one
          struct __telnetSharedMemory__ sharedMemory = {connectionSocket, __connectionSocket__, __telnet_connection_time_out__, false, false, false, false};
          #define tskNORMAL_PRIORITY 1


          #ifdef TELNET_SERVER_CORE
              BaseType_t taskCreated = xTaskCreatePinnedToCore ([] (void *param)  { // client <- ESP32 <- server data transfer
                                                                                    struct __telnetSharedMemory__ *sharedMemory = (struct __telnetSharedMemory__ *) param;
                                                                                    while (!sharedMemory->threadTowardsServerFinished) { // while the other task is running
                                                                                        char buffer [512];
                                                                                        int readTotal = recvAll (sharedMemory->socketTowardsServer, buffer, sizeof (buffer), NULL, sharedMemory->time_out);
                                                                                        if (readTotal <= 0) {
                                                                                            // error while reading data from server, we don't care if it is time-out or something else
                                                                                            break;
                                                                                        } else {
                                                                                            if (sendAll (sharedMemory->socketTowardsClient, buffer, readTotal, sharedMemory->time_out) <= 0) {
                                                                                                // error while writing data to client, we don't care if it is time-out or something else
                                                                                                #ifdef __DMESG__
                                                                                                    dmesgQueue << "[telnetConnection] send (to other telnet server) error: " << errno << " " << strerror (errno);
                                                                                                #endif
                                                                                                break;
                                                                                            }
                                                                                        }
                                                                                        delay (1);
                                                                                    }
                                                                                    sharedMemory->threadTowardsClientFinished = true; // signal the other task that this task has stopped
                                                                                    vTaskDelete (NULL);
                                                                                  }, 
                                                                __func__, 
                                                                4068, 
                                                                &sharedMemory,
                                                                tskNORMAL_PRIORITY,
                                                                NULL,
                                                                TELNET_SERVER_CORE);
          #else
              BaseType_t taskCreated = xTaskCreate ([] (void *param)  { // client <- ESP32 <- server data transfer
                                                                        struct __telnetSharedMemory__ *sharedMemory = (struct __telnetSharedMemory__ *) param;
                                                                        while (!sharedMemory->threadTowardsServerFinished) { // while the other task is running
                                                                            char buffer [512];
                                                                            int readTotal = recvAll (sharedMemory->socketTowardsServer, buffer, sizeof (buffer), NULL, sharedMemory->time_out);
                                                                            if (readTotal <= 0) {
                                                                                // error while reading data from server, we don't care if it is time-out or something else
                                                                                break;
                                                                            } else {
                                                                                if (sendAll (sharedMemory->socketTowardsClient, buffer, readTotal, sharedMemory->time_out) <= 0) {
                                                                                    // error while writing data to client, we don't care if it is time-out or something else
                                                                                    #ifdef __DMESG__
                                                                                        dmesgQueue << "[telnetConnection] send (to other telnet server) error: " << errno << " " << strerror (errno);
                                                                                    #endif
                                                                                    break;
                                                                                }
                                                                            }
                                                                            delay (1);
                                                                        }
                                                                        sharedMemory->threadTowardsClientFinished = true; // signal the other task that this task has stopped
                                                                        vTaskDelete (NULL);
                                                                      }, 
                                __func__, 
                                4068, 
                                &sharedMemory,
                                tskNORMAL_PRIORITY,
                                NULL);
          #endif
          if (pdPASS != taskCreated) {
            close (connectionSocket);
            return "xTaskCreate error";
          } 
                                                        { // client -> ESP32 -> server data transfer
                                                          while (!sharedMemory.threadTowardsClientFinished) { // while the other task is running
                                                              char buffer [512];
                                                              int readTotal = recvAll (sharedMemory.socketTowardsClient, buffer, sizeof (buffer), NULL, __telnet_connection_time_out__);
                                                              if (readTotal <= 0) {
                                                                  // error while reading data from client
                                                                  if (errno != EAGAIN && errno != ENAVAIL) sharedMemory.clientTimeOut = true;
                                                                  else                                     sharedMemory.clientError = true;
                                                              } else {
                                                                  if (sendAll (sharedMemory.socketTowardsServer, buffer, readTotal, __telnet_connection_time_out__) <= 0) {
                                                                      // error while writing data to server, we don't care if it is time-out or something else
                                                                      #ifdef __DMESG__
                                                                          dmesgQueue << "[telnetConnection] send (to other telnet server) error: " << errno << " " << strerror (errno);
                                                                      #endif
                                                                      break;
                                                                  }
                                                              }
                                                              delay (1);
                                                          }
                                                          sharedMemory.threadTowardsServerFinished = true; // signal the other task that this task has stopped
                                                          // wait the other task to finish
                                                          while (!sharedMemory.threadTowardsClientFinished) delay (1);
                                                        }

          close (connectionSocket);
          if (sharedMemory.clientTimeOut) { tcn->closeConnection (); return ""; }
          if (sharedMemory.clientError)   { sendTelnet ("\r\nTime-out"); tcn->closeConnection (); return ""; }
          // tell the client to go into character mode, not to echo and send its window size, just in case the other server has changed that
          return IAC WILL ECHO IAC WILL SUPPRESS_GO_AHEAD IAC DO NAWS "\r\nConnection to host lost.";
      }

      #ifdef __HTTP_CLIENT__

        cstring __curl__ (const char *method, char *url, telnetConnection *tcn) {
            char server [65];
            char addr [128] = "/";
            int port = 80;
            if (sscanf (url, "http://%64[^:]:%i/%126s", server, &port, addr + 1) < 2) { // we haven't got at least server, port and the default address
                if (sscanf (url, "http://%64[^/]/%126s", server, addr + 1) < 1) { // we haven't got at least server and the default address  
                    return "Wrong url, use form of http://server/address or http://server:port/address";
                }
            }
            if (port <= 0) return "Wrong port number, it should be > 0";
            String r = httpClient (server, port, addr, method);
            if (!r) return "Out of memory";
            sendTelnet (r.c_str ());
            return "";            
        }

      #endif

      #ifdef __FILE_SYSTEM__        

