BojanJurca/Esp32_oscilloscope/servers/telnetServer.hpp
        bool telnetUserHasRightToAccessFile (char *fullPath) { return strstr (fullPath, __homeDir__) == fullPath; }
        bool telnetUserHasRightToAccessDirectory (char *fullPath) { return telnetUserHasRightToAccessFile (cstring (fullPath) + "/"); }
        
        #if (FILE_SYSTEM & FILE_SYSTEM_FAT) == FILE_SYSTEM_FAT
            const char *__mkfs__ (telnetConnection *tcn) {
                if (sendTelnet ("formatting FAT file system, please wait ... ") <= 0) return ""; 
                fileSystem.unmount ();
                if (fileSystem.formatFAT ()) {
                                                          return "formatted.";
                    if (fileSystem.mountFAT (false))      return "\r\nFAT file system mounted,\r\nreboot now to create default configuration files\r\nor you can create them yorself before rebooting.";
                    else                                  return "formatted but failed to mount the file system."; 
                } else                                    return "failed.";
                return "";
            }
        #endif

        #if (FILE_SYSTEM & FILE_SYSTEM_LITTLEFS) == FILE_SYSTEM_LITTLEFS
            const char *__mkfs__ (telnetConnection *tcn) {
                if (sendTelnet ("formatting LittleFs file system, please wait ... ") <= 0) return ""; 
                fileSystem.unmount ();
                if (fileSystem.formatLittleFs ()) {
                                                          return "formatted.";
                    if (fileSystem.mountLittleFs (false)) return "\r\nLittleFs file system mounted,\r\nreboot now to create default configuration files\r\nor you can create them yorself before rebooting.";
                    else                                  return "formatted but failed to mount the file system."; 
                } else                                    return "failed.";
                return "";
            }
        #endif
  
        cstring __fs_info__ () {
            if (!fileSystem.mounted ()) return "File system not mounted. You may have to format flash disk first.";
            cstring s = ""; // string = Ctring<300> so we have enough space
            
            #if (FILE_SYSTEM & FILE_SYSTEM_FAT) == FILE_SYSTEM_FAT
                sprintf (s, "FAT file system --------------------\r\n"
                            "Total space:      %10lu K bytes\r\n"
                            "Total space used: %10lu K bytes\r\n"
                            "Free space:       %10lu K bytes\r\n",
                            FFat.totalBytes () / 1024, 
                            FFat.usedBytes () / 1024, 
                            (FFat.totalBytes () - FFat.usedBytes ()) / 1024
                      );
            #endif

            #if (FILE_SYSTEM & FILE_SYSTEM_LITTLEFS) == FILE_SYSTEM_LITTLEFS
                sprintf (s, "LittleFS file system:\r\n"
                            "Total space:      %10i K bytes\r\n"
                            "Total space used: %10i K bytes\r\n"
                            "Free space:       %10i K bytes\r\n",
                            LittleFS.totalBytes () / 1024, 
                            LittleFS.usedBytes () / 1024, 
                            (LittleFS.totalBytes () - LittleFS.usedBytes ()) / 1024
                      );
            #endif

            #if (FILE_SYSTEM & FILE_SYSTEM_SD_CARD) == FILE_SYSTEM_SD_CARD
                // if (sendTelnet ((char *) s) <= 0) return ""; 

                const char *cardTypeText = "unknown";
                uint8_t cardType = SD.cardType ();
                switch (cardType) {
                    case CARD_NONE: cardTypeText = "no SD card attached"; break;
                    case CARD_MMC:  cardTypeText = "MMC"; break;
                    case CARD_SD:   cardTypeText = "SDSC"; break;
                    case CARD_SDHC: cardTypeText = "SDHC"; break;
                }

                sprintf (s + strlen (s), "SD card ----------------------------\r\n"
                                         "Type:   %20s\r\n", cardTypeText);
            #endif

            return s;
        } 

        const char *__diskstat__ (unsigned long delaySeconds, telnetConnection *tcn) {
            // variables for delta calculation
            diskTrafficInformationType lastDiskTrafficInformation = {}; 

            char s [256];

            // display header
            sprintf (s, "\r\n"
                        "bytes read   bytes written\r\n"
                        "--------------------------");
            if (sendTelnet (s) <= 0) return "";

            do {
                sprintf (s, "\r\n  %8lu        %8lu", diskTrafficInformation.bytesRead, diskTrafficInformation.bytesWritten);
                if (sendTelnet (s) <= 0) return "";

                // update variables for delta calculation
                lastDiskTrafficInformation = diskTrafficInformation;

                // wait for a key press
                unsigned long startMillis = millis ();
                while (millis () - startMillis < (delaySeconds * 1000)) {
                    delay (100);
                    if (tcn->recvTelnetChar (true)) {
                        tcn->recvTelnetChar (false); // read pending character
                        return ""; // return if user pressed Ctrl-C or any key
                    } 
                    if (tcn->connectionTimeOut ()) { sendTelnet ("\r\nTime-out"); tcn->closeConnection (); return ""; }
                }

            } while (delaySeconds);
            return "";
        }        
  
        cstring __ls__ (char *directoryName, telnetConnection *tcn) {
            if (!fileSystem.mounted ())                     return "File system not mounted. You may have to format flash disk first.";
            cstring fp = fileSystem.makeFullPath (directoryName, __workingDir__);
            if (fp == "" || !fileSystem.isDirectory (fp))   return "Invalid directory name.";
            if (!telnetUserHasRightToAccessDirectory (fp))  return "Access denyed.";

            // display information about files and subdirectories
            bool firstRecord = true;
            File d = fileSystem.open (fp); 
            if (!d) return "Out of resources";
            for (File f = d.openNextFile (); f; f = d.openNextFile ()) {
                cstring fullFileName = fp;
                if (fullFileName [fullFileName.length () - 1] != '/') fullFileName += '/'; fullFileName += f.name ();
                if (sendTelnet (firstRecord ? fileSystem.fileInformation (fullFileName) : cstring ("\r\n") + fileSystem.fileInformation (fullFileName)) <= 0) { d.close (); return "Out of memory"; }
                firstRecord = false;
            }
            d.close ();
            return "";            
        }
  
        // iteratively scan directory tree, recursion takes too much stack
        const char *__tree__ (char *directoryName, telnetConnection *tcn) {
            if (!fileSystem.mounted ())                     return "File system not mounted. You may have to format flash disk first.";
            cstring fp = fileSystem.makeFullPath (directoryName, __workingDir__);
            if (fp == "" || !fileSystem.isDirectory (fp))   return "Invalid directory name.";
            if (!telnetUserHasRightToAccessDirectory (fp))  return "Access denyed.";

            // keep directory names saved in vector for later recursion   
            vector<cstring> dirList (5); 
            if (dirList.push_back (fp)) return "Out of memory";
            bool firstRecord = true;
            while (dirList.size () != 0) {

                // 1. take the first directory from dirList
                fp = dirList [0];
                dirList.erase (0);

                // 2. display directory info
                 if (sendTelnet (firstRecord ? fileSystem.fileInformation (fp, true) : cstring ("\r\n") + fileSystem.fileInformation (fp, true)) <= 0) return "Out of memory";
                 firstRecord = false;

                // 3. display information about files and remember subdirectories in dirList
                File d = fileSystem.open (fp); 
                if (!d) return "Out of resources";
                for (File f = d.openNextFile (); f; f = d.openNextFile ()) {
                    if (f.isDirectory ()) {
                        // save directory name for later recursion
                        #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL (4, 4, 0) || FILE_SYSTEM == FILE_SYSTEM_LITTLEFS // f.name contains only a file name without path
                            cstring dp = fp; if (dp [dp.length () - 1] != '/') dp += '/'; dp += f.name ();                          
                            if (dirList.push_back (dp)) { d.close (); return "Out of memory"; }
                        #else                                                                                       // f.name contains full file path
                            if (dirList.push_back (f.name ())) { d.close (); return "Out of memory"; }
                        #endif
                    } else {
                        #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL (4, 4, 0) || FILE_SYSTEM == FILE_SYSTEM_LITTLEFS // f.name contains only a file name without path
                            cstring dp = fp; if (dp [dp.length () - 1] != '/') dp += '/'; dp += f.name ();
                            if (sendTelnet (cstring ("\r\n") + fileSystem.fileInformation (dp, true)) <= 0) { d.close (); return "Out of memory"; }
                        #else                                                                                         // f.name contains full file path
                            if (sendTelnet (cstring ("\r\n") + fileSystem.fileInformation (f.name (), true)) <= 0) { d.close (); return "Out of memory"; }
                        #endif                              
                    }
                }
                d.close ();
            }
            return "";    
        }

        cstring __catFileToClient__ (char *fileName, telnetConnection *tcn) {
            if (!fileSystem.mounted ())               return "File system not mounted. You may have to format flash disk first.";
            cstring fp = fileSystem.makeFullPath (fileName, __workingDir__);
            if (fp == "" || !fileSystem.isFile (fp))  return "Invalid file name.";
            if (!telnetUserHasRightToAccessFile (fp)) return "Access denyed.";

            char buff [1500]; // MTU = 1500 (maximum transmission unit), TCP_SND_BUF = 5744 (a maximum block size that ESP32 can send), FAT cluster size = n * 512. 1500 seems the best option
            *buff = 0;
            
            File f;
            if ((bool) (f = fileSystem.open (fp, "r"))) {
                int i = strlen (buff);
                while (f.available ()) {
                    switch (*(buff + i) = f.read ()) {
                      case '\r':  // ignore
                                  break;
                      case '\n':  // LF-CRLF conversion
                                  *(buff + i ++) = '\r'; 
                                  *(buff + i ++) = '\n';
                                  break;
                      default:
                                  i ++;                  
                    }
                    if (i >= sizeof (buff) - 2) { 

                                                  diskTrafficInformation.bytesRead += i; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way

                                                  if (sendTelnet (buff, i) <= 0) { f.close (); return ""; }
                                                  i = 0; 
                                                }
                    }
                    if (i)                      { 

                                                    diskTrafficInformation.bytesRead += i; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way

                                                    if (sendTelnet (buff, i) <= 0) { f.close (); return ""; }
                                                }
              } else {
                  f.close (); return cstring ("Can't read ") + fp;
              }
              f.close ();
              return "";
        }

        cstring __catClientToFile__ (char *fileName, telnetConnection *tcn) {
          if (!fileSystem.mounted ())                   return "File system not mounted. You may have to format flash disk first.";
          cstring fp = fileSystem.makeFullPath (fileName, __workingDir__);
          if (fp == "" || fileSystem.isDirectory (fp))  return "Invalid file name.";
          if (!telnetUserHasRightToAccessFile (fp))     return "Access denyed.";

          File f;
          if ((bool) (f = fileSystem.open (fp, "w"))) {
            while (char c = recvTelnetChar ()) { 
              switch (c) {
                case 0: // Error
                case 3: // Ctrl-C
                        f.close (); return fp + " not fully written.";
                case 4: // Ctrl-D or Ctrl-Z
                        f.close (); return cstring ("\r\n") + fp + " written.";
                case 13: // ignore
                        break;
                case 10: // LF -> CRLF conversion
                        if (f.write ((uint8_t *) "\r\n", 2) != 2) { 
                          f.close (); return cstring ("Can't write ") + fp;
                        } 

                        diskTrafficInformation.bytesWritten += 2; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way

                        // echo
                        if (sendTelnet ("\r\n") <= 0) return "";
                        break;
                default: // character 
                        if (f.write ((uint8_t *) &c, 1) != 1) { 
                          f.close (); return cstring ("Can't write ") + fp;
                        } 

                        diskTrafficInformation.bytesWritten += 1; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way

                        // echo
                        if (sendTelnet (&c, 1) <= 0) return "";
                        break;
              }
            }
            f.close ();
          } else {
            return cstring ("Can't write ") + fp;
          }
          return "";
        }

        cstring __tail__ (char *fileName, bool follow, telnetConnection *tcn) {
            if (!fileSystem.mounted ())               return "File system not mounted. You may have to format flash disk first.";
            cstring fp = fileSystem.makeFullPath (fileName, __workingDir__);
            if (fp == "" || !fileSystem.isFile (fp))  return "Invalid file name.";
            if (!telnetUserHasRightToAccessFile (fp)) return "Access denyed.";

            File f;
            size_t filePosition = 0;
            do {
                if ((bool) (f = fileSystem.open (fp, "r"))) {
                    // if this is the first time skip to (almost) the end of file
                    if (filePosition == 0) {
                        size_t fileSize = f.size ();
                        // move to 512 bytes before the end of the file
                        f.seek (fileSize > 512 ? fileSize - 512 : 0);
                        // move past next \n
                        while (f.available () && f.read () != '\n') {

                          diskTrafficInformation.bytesRead += 1; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way

