BojanJurca/Esp32_oscilloscope/servers/telnetServer.hpp
                        }
                        filePosition = f.position ();
                    } else {
                        f.seek (filePosition);
                    }
                    if (f.size () > filePosition) {
                        // display the rest of the file
                        while (f.available ()) {
                            char c;
                            switch ((c = f.read ())) {
                              case '\r':  // ignore
                                          break;
                              case '\n':  // LF-CRLF conversion
                                          if (sendTelnet ("\r\n") <= 0) { f.close (); return ""; }
                                          break;
                              default:
                                          if (sendTelnet (&c, sizeof (c)) <= 0) { f.close (); return ""; }
                          }

                          diskTrafficInformation.bytesRead += 1; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way

                      }
                  }
                  filePosition = f.position (); 
                  f.close ();
              } else {
                  return cstring ("Can't read ") + fp;
              }
              // follow?
              if (follow) {
                  unsigned long startMillis = millis ();
                  while (millis () - startMillis < 1000) {
                      if (tcn->recvTelnetChar (true)) {
                          tcn->recvTelnetChar (false); // read pending character
                          f.close ();
                          return ""; // return if user pressed Ctrl-C or any key
                      }
                      if (tcn->connectionTimeOut ()) { sendTelnet ("\r\nTime-out"); tcn->closeConnection (); return ""; } 
                      delay (100);
                    }
                } else {
                    return "";
                }
            } while (true);
            return "";
        }

        cstring __mkdir__ (char *directoryName) { 
            if (!fileSystem.mounted ())                     return "File system not mounted. You may have to format flash disk first.";
            cstring fp = fileSystem.makeFullPath (directoryName, __workingDir__);
            if (fp == "")                                   return "Invalid directory name.";
            if (!telnetUserHasRightToAccessDirectory (fp))  return "Access denyed.";
    
            if (fileSystem.makeDirectory (fp))              return fp + " made.";
                                                            return cstring ("Can't make ") + fp;
        }
  
        cstring __rmdir__ (char *directoryName) { 
            if (!fileSystem.mounted ())                     return "File system not mounted. You may have to format flash disk first.";
            cstring fp = fileSystem.makeFullPath (directoryName, __workingDir__);
            if (fp == "" || !fileSystem.isDirectory (fp))   return "Invalid directory name.";
            if (!telnetUserHasRightToAccessDirectory (fp))  return "Access denyed.";
            if (fp == __homeDir__)                          return "You can't remove your home directory.";
            if (fp == __workingDir__)                       return "You can't remove your working directory.";
    
            if (fileSystem.removeDirectory (fp))            return fp + " removed.";
                                                            return cstring ("Can't remove ") + fp;
        }      

        cstring __cd__ (const char *directoryName) { 
            if (!fileSystem.mounted ())                     return "File system not mounted. You may have to format flash disk first.";
            cstring fp = fileSystem.makeFullPath (directoryName, __workingDir__);
            if (fp == "" || !fileSystem.isDirectory (fp))   return "Invalid directory name.";
            if (!telnetUserHasRightToAccessDirectory (fp))  return "Access denyed.";
    
            strcpy (__workingDir__, fp);                    return cstring ("Your working directory is ") + fp;
        }

        cstring __pwd__ () { 
            if (!fileSystem.mounted ()) return "File system not mounted. You may have to format flash disk first.";
            // remove extra /
            cstring s (__workingDir__);
            if (s [s.length () - 1] == '/') s [s.length () - 1] = 0;
            if (s == "") s = "/"; 
            return cstring ("Your working directory is ") + s;
        }

        cstring __mv__ (char *srcFileOrDirectory, char *dstFileOrDirectory) { 
            if (!fileSystem.mounted ())                       return "File system not mounted. You may have to format flash disk first.";
            cstring fp1 = fileSystem.makeFullPath (srcFileOrDirectory, __workingDir__);
            cstring fp2;
            if (fp1 == "")                                    return "Invalid source file or directory name.";
            if (fileSystem.isDirectory (fp1)) {
                if (!telnetUserHasRightToAccessDirectory (fp1)) return "Access to source file or directory denyed.";
                fp2 = fileSystem.makeFullPath (dstFileOrDirectory, __workingDir__);
                if (fp2 == "")                                  return "Invalid destination file or directory name.";
                if (!telnetUserHasRightToAccessDirectory (fp1)) return "Access destination file or directory denyed.";            
            } else if (fileSystem.isFile (fp1)) {
                if (!telnetUserHasRightToAccessFile (fp1))      return "Access to source file or directory denyed.";
                cstring fp2 = fileSystem.makeFullPath (dstFileOrDirectory, __workingDir__);
                if (fp2 == "")                                  return "Invalid destination file or directory name.";
                if (!telnetUserHasRightToAccessFile (fp1))      return "Access destination file or directory denyed.";
            } else {
                                                                return "Invalid source file or directory name.";
            }
            
            if (fileSystem.rename (fp1, fp2))                 return cstring ("Renamed to ") + fp2;
                                                              return cstring ("Can't rename ") + fp1;
        }

        cstring __cp__ (char *srcFileName, char *dstFileName) { 
          if (!fileSystem.mounted ())                 return "File system not mounted. You may have to format flash disk first.";
          cstring fp1 = fileSystem.makeFullPath (srcFileName, __workingDir__);
          if (fp1 == "")                              return "Invalid source file name.";
          if (!telnetUserHasRightToAccessFile (fp1))  return "Access to source file denyed.";
          cstring fp2 = fileSystem.makeFullPath (dstFileName, __workingDir__);
          if (fp2 == "")                              return "Invalid destination file name.";
          if (!telnetUserHasRightToAccessFile (fp1))  return "Access destination file denyed.";

          File f1, f2;
          cstring retVal = "File copied.";
          
          if (!(bool) (f1 = fileSystem.open (fp1, "r"))) { return cstring ("Can't read ") + fp1; }
          if (f1.isDirectory ()) { f1.close (); return cstring ("Can't read ") + fp1; }
          if (!(bool) (f2 = fileSystem.open (fp2, "w"))) { f1.close (); return cstring ("Can't write ") + fp2; }

          int bytesReadTotal = 0;
          int bytesWrittenTotal = 0;
          #define CP_BUFF_SIZE 2 * 1024
          char buff [CP_BUFF_SIZE];
          do {
              int bytesReadThisTime = f1.read ((uint8_t *) buff, sizeof (buff));
              if (bytesReadThisTime == 0) break; // finished, success
              bytesReadTotal += bytesReadThisTime;

              diskTrafficInformation.bytesRead += bytesReadThisTime; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way

              int bytesWrittenThisTime = f2.write ((uint8_t *) buff, bytesReadThisTime);
              bytesWrittenTotal += bytesWrittenThisTime;

