BojanJurca/Esp32_oscilloscope/servers/telnetServer.hpp
              diskTrafficInformation.bytesWritten += bytesWrittenThisTime; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way

              if (bytesWrittenThisTime != bytesReadThisTime) { retVal = cstring ("Can't write ") + fp2; break; } 
          } while (true);
          
          f2.close ();
          f1.close ();
          return retVal;
        }

        cstring __rm__ (char *fileName) {
            if (!fileSystem.mounted ())               return "File system not mounted. You may have to format flash disk first.";
            cstring fp = fileSystem.makeFullPath (fileName, __workingDir__);
            if (fp == "" || !fileSystem.isFile (fp))  return "Invalid file name.";
            if (!telnetUserHasRightToAccessFile (fp)) return "Access denyed.";

            if (fileSystem.deleteFile (fp))           return fp + " deleted.";
            else                                      return cstring ("Can't delete ") + fp;
        }

        // not really a vi but small and simple text editor
        cstring __vi__ (char *fileName, telnetConnection *tcn) {
          // a good reference for telnet ESC codes: https://en.wikipedia.org/wiki/ANSI_escape_code
          // and: https://docs.microsoft.com/en-us/windows/console/console-virtual-terminal-sequences
          if (!fileSystem.mounted ())               return "File system not mounted. You may have to format flash disk first.";

          if (!fileSystem.mounted ())               return "File system not mounted. You may have to format flash disk first.";
          cstring fp = fileSystem.makeFullPath (fileName, __workingDir__);
          if (fp == "")                             return "Invalid file name.";
          if (!telnetUserHasRightToAccessFile (fp)) return "Access denyed.";
  
          // 1. create a new file one if it doesn't exist (yet)
          if (!fileSystem.isFile (fp)) {
            File f = fileSystem.open (fp, "w");
            if (f) { f.close (); if (sendTelnet ("\r\nFile created.") <= 0) return ""; }
            else return cstring ("Can't create ") + fp;
          }
  
          // 2. read the file content into internal vi data structure (lines of Strings)
          #define MAX_LINES 9999 // there are 4 places reserved for line numbers on client screen, so MAX_LINES can go up to 9999
          #define LEAVE_FREE_HEAP 32 * 1024 // always keep at least 32 KB free to other processes so vi command doesn't block everything else from working
          vector<String> lines (25); // vector of Arduino Strings
          // lines.reserve (1000);
          bool dirty = false;
          {
            File f = fileSystem.open (fp, "r");
            if (f) {
              if (!f.isDirectory ()) {
                while (f.available ()) { 
                  if (ESP.getFreeHeap () < LEAVE_FREE_HEAP) { // always leave at least 32 KB free for other things that may be running on ESP32
                    f.close (); 
                    return "Out of memory"; 
                  }
                  char c = (char) f.read ();

                  diskTrafficInformation.bytesRead += 1; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way

                  switch (c) {
                    case '\r':  break; // ignore
                    case '\n':  if (ESP.getFreeHeap () < LEAVE_FREE_HEAP || lines.push_back ("")) { // always leave at least 32 KB free for other things that may be running on ESP32
                                  f.close (); 
                                  return fp + " is too long. Out of memory"; 
                                }
                                if (lines.size () >= MAX_LINES) { 
                                  f.close (); 
                                  return fp + " has too many lines for this simple text editor."; 
                                }
                                break; 
                    case '\t':  if (!lines.size ()) if (lines.push_back ("")) return "Out of memory"; // vi editor (the code below) needs at least 1 (empty) line where text can be entered
                                if (!lines [lines.size () - 1].concat ("    ")) return "Out of memory"; // treat tab as 4 spaces, check success of concatenation
                                break;
                    default:    if (!lines.size ()) if (lines.push_back ("")) return "Out of memory"; // vi editor (the code below) needs at least 1 (empty) line where text can be entered
                                if (!lines [lines.size () - 1].concat (c)) return "Out of memory"; // check success of concatenation
                                break;
                  }
                }
                f.close ();
              } else return "Can't edit a directory.";
              f.close ();
            } else return cstring ("Can't read ") + fp;
          }    
          if (!lines.size ()) if (lines.push_back ("")) return "Out of memory"; // vi editor (the code below) needs at least 1 (empty) line where text can be entered
  
          // 3. discard any already pending characters from client
          while (recvTelnetChar (true)) recvTelnetChar (false);
  
          // 4. get information about client window size
          if (__clientWindowWidth__) { // we know that client reports its window size, ask for latest information (the user might have resized the window since beginning of telnet session)
            if (sendTelnet (IAC DO NAWS) <= 0) return "";
            // client will reply in the form of: IAC (255) SB (250) NAWS (31) col1 col2 row1 row1 IAC (255) SE (240) but this will be handeled internally by readTelnet function
          } else { // just assume the defaults and hope that the result will be OK
            __clientWindowWidth__ = 80; 
            __clientWindowHeight__ = 24;   
          }
          recvTelnetChar (true);
          if (__clientWindowWidth__ < 44 || __clientWindowHeight__ < 5) return "Clinent telnet window is too small for vi.";
  
          // 5. edit 
          int textCursorX = 0;  // vertical position of cursor in text
          int textCursorY = 0;  // horizontal position of cursor in text
          int textScrollX = 0;  // vertical text scroll offset
          int textScrollY = 0;  // horizontal text scroll offset
  
          bool redrawHeader = true;
          bool redrawAllLines = true;
          bool redrawLineAtCursor = false; 
          bool redrawFooter = true;
          cstring message = cstring (" ") + cstring (lines.size ()) + " lines ";
  
                                // clear screen
                                if (sendTelnet ("\x1b[2J") <= 0) return "";  // ESC[2J = clear screen
  
          while (true) {
            // a. redraw screen 
            cstring s;
         
            if (redrawHeader)   { 
                                  s = "\x1b[H----+"; s.rPad (__clientWindowWidth__ - 26, '-'); s += " Save: Ctrl-S, Exit: Ctrl-X -"; // ESC[H = move cursor home
                                  if (sendTelnet (s) <= 0) return "";  
                                  redrawHeader = false;
                                }
            if (redrawAllLines) {
  
