BojanJurca/Esp32_oscilloscope/servers/telnetServer.hpp
      #if USER_MANAGEMENT == UNIX_LIKE_USER_MANAGEMENT      

       const char *__passwd__ (char *userName) {
          char password1 [USER_PASSWORD_MAX_LENGTH + 1];
          char password2 [USER_PASSWORD_MAX_LENGTH + 1];
                    
          if (!strcmp (__userName__, userName)) { // user changing password for himself
            // read current password
            __echo__ = false;
            if (sendTelnet ("Enter current password: ") <= 0)                                             return ""; 
            if (recvTelnetLine (password1, sizeof (password1), true) != 10) { __echo__ = true;            return "\r\nPassword not changed."; }
            __echo__ = true;
            // check if password is valid for user
            if (!userManagement.checkUserNameAndPassword (userName, password1))                           return "Wrong password."; 
          } else {                         // root is changing password for another user
            // check if user exists with getUserHomeDirectory
            char homeDirectory [FILE_PATH_MAX_LENGTH + 1];
            if (!userManagement.getHomeDirectory (homeDirectory, sizeof (homeDirectory), userName))       return "User name does not exist."; 
          }
          // read new password twice
          __echo__ = false;
          if (sendTelnet ("\r\nEnter new password: ") <= 0)                                               return ""; 
          if (recvTelnetLine (password1, sizeof (password1), true) != 10)   { __echo__ = true;            return "\r\nPassword not changed."; }
          if (sendTelnet ("\r\nRe-enter new password: ") <= 0)                                            return ""; 
          if (recvTelnetLine (password2, sizeof (password2), true) != 10)   { __echo__ = true;            return "\r\nPassword not changed."; }
          __echo__ = true;
          // check passwords
          if (strcmp (password1, password2))                                                              return "\r\nPasswords do not match.";
          // change password
          if (userManagement.passwd (userName, password1))                                                return "\r\nPassword changed.";
          else                                                                                            return "\r\nError changing password.";  
        }

      #endif
        
    };


    // ----- telnetServer class -----

    class telnetServer {                                             
    
      public:

        // telnetServer state
        enum STATE_TYPE {
          NOT_RUNNING = 0, 
          STARTING = 1, 
          RUNNING = 2        
        };
        
        STATE_TYPE state () { return __state__; }
    
        telnetServer ( // the following parameters will be pased to each telnetConnection instance
                     String (* telnetCommandHandlerCallback) (int argc, char *argv [], telnetConnection *tcn) = NULL, // telnetCommandHandler callback function provided by calling program
                     // the following parameters will be handeled by telnetServer instance
                     const char *serverIP = "0.0.0.0",                                                                // Telnet server IP address, 0.0.0.0 for all available IP addresses
                     int serverPort = 23,                                                                             // Telnet server port
                     bool (*firewallCallback) (char *connectingIP) = NULL                                             // a reference to callback function that will be celled when new connection arrives 
                   )  { 
                        // create a local copy of parameters for later use
                        __telnetCommandHandlerCallback__ = telnetCommandHandlerCallback;
                        strncpy (__serverIP__, serverIP, sizeof (__serverIP__)); __serverIP__ [sizeof (__serverIP__) - 1] = 0;
                        __serverPort__ = serverPort;
                        __firewallCallback__ = firewallCallback;

                        // start listener in its own thread (task)
                        __state__ = STARTING;                        
                        #define tskNORMAL_PRIORITY 1
                        #ifdef TELNET_SERVER_CORE
                            BaseType_t taskCreated = xTaskCreatePinnedToCore (__listenerTask__, "telnetServer", 2 * 1024, this, tskNORMAL_PRIORITY, NULL, TELNET_SERVER_CORE);
                        #else
                            BaseType_t taskCreated = xTaskCreate (__listenerTask__, "telnetServer", 2 * 1024, this, tskNORMAL_PRIORITY, NULL);
                        #endif
                        if (pdPASS != taskCreated) {
                            #ifdef __DMESG__
                                dmesgQueue << "[telnetServer] xTaskCreate error";
                            #endif
                        } else {
                          // wait until listener starts accepting connections
                          while (__state__ == STARTING) delay (1); 
                          // when constructor returns __state__ could be eighter RUNNING (in case of success) or NOT_RUNNING (in case of error)
                        }
                      }
        
        ~telnetServer ()  {
                          // close listening socket
                          int listeningSocket;
                          xSemaphoreTake (__telnetServerSemaphore__, portMAX_DELAY);
                            listeningSocket = __listeningSocket__;
                            __listeningSocket__ = -1;
                          xSemaphoreGive (__telnetServerSemaphore__);
                          if (listeningSocket > -1) close (listeningSocket);

                          // wait until listener finishes before unloading so that memory variables are still there while the listener is running
                          while (__state__ != NOT_RUNNING) delay (1);
                        }
 
