BojanJurca/Esp32_oscilloscope/servers/telnetServer.hpp
      private:

        STATE_TYPE __state__ = NOT_RUNNING;

        String (* __telnetCommandHandlerCallback__) (int argc, char *argv [], telnetConnection *tcn) = NULL;
        char __serverIP__ [46] = "0.0.0.0";
        int __serverPort__ = 23;
        bool (* __firewallCallback__) (char *connectingIP) = NULL;

        int __listeningSocket__ = -1;

        static void __listenerTask__ (void *pvParameters) {
          {
            // get "this" pointer
            telnetServer *ths = (telnetServer *) pvParameters;  
    
            // start listener
            ths->__listeningSocket__ = socket (PF_INET, SOCK_STREAM, 0);
            if (ths->__listeningSocket__ == -1) {
                #ifdef __DMESG__
                    dmesgQueue << "[telnetServer] socket error: " << errno << " " << strerror (errno);
                #endif
            } else {

              // remember some information that netstat telnet command would use
              additionalSocketInformation [ths->__listeningSocket__ - LWIP_SOCKET_OFFSET] = { __LISTENING_SOCKET__, 0, 0, millis (), millis () };

              // make address reusable - so we won't have to wait a few minutes in case server will be restarted
              int flag = 1;
              if (setsockopt (ths->__listeningSocket__, SOL_SOCKET, SO_REUSEADDR, &flag, sizeof (flag)) == -1) {
                  #ifdef __DMESG__
                      dmesgQueue << "[telnetServer] setsockopt error: " <<  errno << " " << strerror (errno);
                  #endif
              } else {
                // bind listening socket to IP address and port     
                struct sockaddr_in serverAddress; 
                memset (&serverAddress, 0, sizeof (struct sockaddr_in));
                serverAddress.sin_family = AF_INET;
                serverAddress.sin_addr.s_addr = inet_addr (ths->__serverIP__);
                serverAddress.sin_port = htons (ths->__serverPort__);
                if (bind (ths->__listeningSocket__, (struct sockaddr *) &serverAddress, sizeof (serverAddress)) == -1) {
                    #ifdef __DMESG__
                        dmesgQueue << "[telnetServer] bind error: " << errno << " " << strerror (errno);
                    #endif
               } else {
                 // mark socket as listening socket
                 if (listen (ths->__listeningSocket__, 4) == -1) {
                    #ifdef __DMESG__
                        dmesgQueue << "[tlnetServer] listen error: " << errno << " " << strerror (errno);
                    #endif
                 } else {

                  // remember some information that netstat telnet command would use
                  additionalSocketInformation [ths->__listeningSocket__ - LWIP_SOCKET_OFFSET] = { __LISTENING_SOCKET__, 0, 0, millis (), millis () };

                  // listener is ready for accepting connections
                  ths->__state__ = RUNNING;
                  #ifdef __DMESG__
                      dmesgQueue << "[telnetServer] listener is running on core " << xPortGetCoreID ();
                  #endif
                  while (ths->__listeningSocket__ > -1) { // while listening socket is opened

                      int connectingSocket;
                      struct sockaddr_in connectingAddress;
                      socklen_t connectingAddressSize = sizeof (connectingAddress);
                      log_i ("listener taks: stack high-water mark: %lu\n", uxTaskGetStackHighWaterMark (NULL));
                      connectingSocket = accept (ths->__listeningSocket__, (struct sockaddr *) &connectingAddress, &connectingAddressSize);
                      if (connectingSocket == -1) {
                          #ifdef __DMESG__
                              if (ths->__listeningSocket__ > -1) dmesgQueue << "[telnetServer] accept error: " << errno << " " << strerror (errno);
                          #endif
                      } else {

                        // remember some information that netstat telnet command would use
                        additionalSocketInformation [ths->__listeningSocket__ - LWIP_SOCKET_OFFSET].lastActiveMillis = millis ();
                        additionalSocketInformation [connectingSocket - LWIP_SOCKET_OFFSET] = { __TELNET_SERVER_SOCKET__, 0, 0, millis (), millis () };
                        
                        // get client's IP address
                        char clientIP [46]; inet_ntoa_r (connectingAddress.sin_addr, clientIP, sizeof (clientIP)); 
                        // get server's IP address
                        char serverIP [46]; struct sockaddr_in thisAddress = {}; socklen_t len = sizeof (thisAddress);
                        if (getsockname (connectingSocket, (struct sockaddr *) &thisAddress, &len) != -1) inet_ntoa_r (thisAddress.sin_addr, serverIP, sizeof (serverIP));
                        // port number could also be obtained if needed: ntohs (thisAddress.sin_port);
                        if (ths->__firewallCallback__ && !ths->__firewallCallback__ (clientIP)) {
                            #ifdef __DMESG__
                                dmesgQueue << "[telnetServer] firewall rejected connection from " << clientIP;
                            #endif
                            close (connectingSocket);
                        } else {
                          // make the socket non-blocking so that we can detect time-out
                          if (fcntl (connectingSocket, F_SETFL, O_NONBLOCK) == -1) {
                              #ifdef __DMESG__
                                  dmesgQueue << "[telnetServer] fcntl error: " << errno << " " << strerror (errno);
                              #endif
                              close (connectingSocket);
                          } else {
                                // create telnetConnection instence that will handle the connection, then we can lose reference to it - telnetConnection will handle the rest
                                telnetConnection *tcn = new (std::nothrow) telnetConnection (connectingSocket, ths->__telnetCommandHandlerCallback__, clientIP, serverIP);
                                if (!tcn) {
                                    #ifdef __DMESG__
                                        dmesgQueue << "[telnetConnection] service unavaliable";
                                    #endif
                                    sendAll (connectingSocket, telnetServiceUnavailable, TELNET_CONNECTION_TIME_OUT);
                                    close (connectingSocket); // normally telnetConnection would do this but if it is not created we have to do it here
                                } else {
                                  if (tcn->state () != telnetConnection::RUNNING) {
                                      #ifdef __DMESG__
                                          dmesgQueue << "[telnetConnection] service unavaliable";
                                      #endif
                                      sendAll (connectingSocket, telnetServiceUnavailable, TELNET_CONNECTION_TIME_OUT);
                                      delete (tcn); // normally telnetConnection would do this but if it is not running we have to do it here
                                  }
                                }

                          } // fcntl
                        } // firewall
                      } // accept
                      
                  } // while accepting connections
                  #ifdef __DMESG__
                      dmesgQueue << "[telnetServer] stopped";
                  #endif
          
                 } // listen
               } // bind
              } // setsockopt
              int listeningSocket;
              xSemaphoreTake (__telnetServerSemaphore__, portMAX_DELAY);
                listeningSocket = ths->__listeningSocket__;
                ths->__listeningSocket__ = -1;
              xSemaphoreGive (__telnetServerSemaphore__);
              if (listeningSocket > -1) close (listeningSocket);
            } // socket
            ths->__state__ = NOT_RUNNING;
          }
          // stop the listening thread (task)
          vTaskDelete (NULL); // it is listener's responsibility to close itself          
        }
          
    };

#endif
